Repository: arkanoid1/Yanitta
Catalog: Yanitta/Localization.*.resx
Languages: ru

source: Ability list
ru: Список способностей

source: Actions
ru: События

# AddAbility
source: Append new ability
ru: Добавить новую способность

# AddProfile
source: Append new profile
ru: Добавить новый профиль

# AddRotation
source: append new rotation
ru: Добавить новую ротацию

# AlavilableAbilitys
source: Alavilable abilities
ru: Доступные способности

# CancelChanel
source: Drop chanel
ru: Прерывать потоковые

source: Cencel
ru: Отмена

source: Class
ru: Класс

source: Close
ru: Закрыть

source: Constructor
ru: Конструктор

# CopyAbility
source: Copy current ability
ru: Скопировать текущую способность

# CopyRotation
source: Copy current rotation
ru: Скопировать текущую ротацию

source: Current rotation
ru: Текущая ротация

source: Delay
ru: Задержка

# DeleteAbility
source: Drop current ability
ru: Удалить текущую способность

# DeleteRotation
source: Drop current rotation
ru: Удалить текущию ротацию

# EditorTitle
source: Profile editor
ru: Редактор профилей

source: Help
ru: Помощь

# IsUseIncombat
source: Use in combat
ru: Использовать в бою

source: Minimise
ru: Свернуть

source: Name
ru: Имя

source: OK
ru: Да

source: Profile
ru: Профиль

# ProfileFileMask
source: "XML files (*.xml)|*.xml|All files (*.*)|*.*"
ru: "XML файлы (*.xml)|*.xml|Все файлы (*.*)|*.*"

source: Rotation list
ru: Список ротаций

source: Setting
ru: Настройки

source: Sound
ru: Звук

source: Spell
ru: Заклинание

source: Target
ru: Цель

# Title
source: Yanitta
ru: Долбилка

# CodeConsole
source: Console
ru: Консоль кода

source: Rotation
ru: Ротация

source: Before rotation code
ru: Код профиля

# BeforeRotationCodeToolTip
source: This code exequted before rotation started
ru: Этот код выполняется при старте ротации

# CancelChanelToolTip
source: Drop channel spell
ru: Прерывать канальные заклинания.

# CancelCastingToolTip
source: Drop casting spell
ru: Прерывать чтение заклинаний

# TargetToolTip
source: Target type
ru: Тип цели

# IsInCombatToolTip
source: Check in combat
ru: Проверка на нахождение в бою

# CancelCasting
source: Drop casting
ru: Прерывать заклинания

# CoreHeader
source: Core
ru: Код ядра

# CoreHeaderToolTip
source: Contains handler code abilities
ru: Содержит код обработчика способностей

# GlobalFunk
source: Common functions
ru: Общие функции

# GlobalFunkToolTip
source: Common functions that can be used to write the rotation.
ru: Общие функции, которые можно использовать в написании ротации.

# UpdateToolTip
source: Check updates
ru: Проверить обновление базы профилей

# ReloadToolTip
source: Reload profiles
ru: Перезагрузить профили из файла

# CloseToolTip
source: Close window
ru: Закрыть текущее окно

# Update
source: Check update
ru: Обновить

source: Reload
ru: Перезагрузить

source: Save
ru: Сохранить

# HelpToolTip
source: Show help
ru: Показать справку

source: Hot key
ru: Гарячая клавиша

# WowClass_Warrior
source: Warrior
ru: Воин

# WowClass_Paladin
source: Paladin
ru: Паладин

# WowClass_Hunter
source: Hunter
ru: Охотник

# WowClass_Rogue
source: Rogue
ru: Разбойник

# WowClass_Priest
source: Priest
ru: Жрец

# WowClass_DeathKnight
source: Death Knight
ru: Рыцарь смерти

# WowClass_Shaman
source: Shaman
ru: Шаман

# WowClass_Mage
source: Mage
ru: Маг

# WowClass_Warlock
source: Warlock
ru: Чернокнижник

# WowClass_Monk
source: Monk
ru: Монах

# WowClass_Druid
source: Druid
ru: Друид

# SpellIdToolTip
source: Spell Id
ru: Идентификатор заклинания, межет быть 0 если требуется специальная обработка.

# NameToolTip
source: Ability name
ru: Наименование способности, это ключевое поле при построении ротации. Всегда должно быть заполнено, не допускает дубликатов.

# IsMovingCheck
source: Moving check
ru: Движение персонажа

# IsMovingCheckToolTip
source: If true, then there is a check if the character is moving before you cast.
ru: Проверяет состояние персонажа на предмет движения перед началом чтения заклинания.

# MovingStates_None
source: None
ru: Не использовать

# MovingStates_Moving
source: Moving
ru: Двигается

# MovingStates_NotMoving
source: Not moving
ru: Не двигается

source: Author
ru: Автор:

source: Version
ru: Версия:

# UpdAdress
source: Update adress
ru: Адресс обновления:

source: Profile info
ru: Информация по профилю

# CodeExequteTitle
source: Lua tester
ru: Отладчик Lua

# ProcessName
source: Process:
ru: Процесс:

# CommandRun
source: Run (F5)
ru: Выполнить (F5)

# NotSelectedProcessMessage
source: Not selected prosess
ru: Не выбран просесс

source: Curent profile:
ru: Текущий профиль:

source: Ability count:
ru: Количество способностей:

source: Rotation count:
ru: Количество ротаций:

source: File
ru: Файл

# Rotation_Code
source: Code
ru: Ротация: Kод

# Rotation_TickDelay
source: Tick delay (ms):
ru: Задержка (мс):

# Rotation_TickDelayToolTip
source: Tick delay (ms)
ru: Задержка для тика ротации (мс)

source: Ability
ru: Способность

source: Ability: Code
ru: Способность: Код

# Ability_Filter
source: Filter:
ru: Фильтр:

# Rotation_Name
source: Name:
ru: Наименование:

# AbilityDelQuestion
source: Do you really want to delete the current ability?
ru: Вы действительно хотите удалить текущую способность?

# RotationDelQuestion
source: Do you really want to delete the current rotation?
ru: Вы действительно хотите удалить текущую ротацию?
